In [9]:
#!pip install sqlalchemy

In [15]:
import pandas as pd

df = pd.read_csv('./DataSource/fake_company.csv')
df.head(2)

   Year   Name Department  Age  Salary
0  1990  Alice         HR   25   50000
1  1990    Bob         RD   30   48000

In [16]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqldb.db')

In [20]:
# Store cleaned master DataFrame ('df') in a table called master in bestofrt.db
# bestofrt.db will be visible now in the Jupyter Notebook dashboard
#df.to_sql('master', engine, index=False)
df.to_sql('company', engine, index=False)

In [21]:
df_gather = pd.read_sql('SELECT * FROM company', engine)
df_gather

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice      Admin   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   28   62000

In [29]:
import pandas as pd

count = pd.Series(list(df))
count

0          Year
1          Name
2    Department
3           Age
4        Salary
dtype: object

In [36]:
str1 = ['951-719-9170ZoeWellish@superrito.com', ]

for i in str1:
    if i.isalpha(): 
        b = str1.find(i)
        print(b) 
        break


#print(str1.loc('Z'))

12